In [114]:
import numpy as np
import pandas as pd

In [115]:
a1 = ['송중기', 1, 92, 82, 17]
a2 = ['권보아', 1, 89, 97, 17]
a3 = ['김나형', 1, 71, 91, 18]
a4 = ['박효신', 1, 90, 78, 18]
a5 = ['김선미', 1, 83, 78, 19]
a6 = ['강민경', 1, 81, 91, 19]
col = ['이름', '반', '영어', '국어', '나이']

df1 = pd.DataFrame([a1, a2, a3, a4, a5, a6], columns=col)
df2 = df1.copy()
df3 = df1.copy()
df4 = df1.copy()

In [116]:
df1

    이름  반  영어  국어  나이
0  송중기  1  92  82  17
1  권보아  1  89  97  17
2  김나형  1  71  91  18
3  박효신  1  90  78  18
4  김선미  1  83  78  19
5  강민경  1  81  91  19

In [117]:
df1 = df1.set_index(['반','이름'])
df1

       영어  국어  나이
반 이름
1 송중기  92  82  17
  권보아  89  97  17
  김나형  71  91  18
  박효신  90  78  18
  김선미  83  78  19
  강민경  81  91  19

In [118]:
ser1 = pd.Series(df1[['국어','영어']].mean(axis=1), name='평균')
df1 = pd.concat([df1, ser1], axis=1)

In [119]:
df1

       영어  국어  나이    평균
반 이름
1 송중기  92  82  17  87.0
  권보아  89  97  17  93.0
  김나형  71  91  18  81.0
  박효신  90  78  18  84.0
  김선미  83  78  19  80.5
  강민경  81  91  19  86.0

In [120]:
df1['평점'] = df1.apply(lambda x: 'A' if x.평균 > 90 else 'B'\
                      if x.평균 > 80 else 'C', axis=1)
df1

       영어  국어  나이    평균 평점
반 이름
1 송중기  92  82  17  87.0  B
  권보아  89  97  17  93.0  A
  김나형  71  91  18  81.0  B
  박효신  90  78  18  84.0  B
  김선미  83  78  19  80.5  B
  강민경  81  91  19  86.0  B

In [121]:
df1['rank'] = df1.평균.rank(ascending=False )
df1

       영어  국어  나이    평균 평점  rank
반 이름
1 송중기  92  82  17  87.0  B   2.0
  권보아  89  97  17  93.0  A   1.0
  김나형  71  91  18  81.0  B   5.0
  박효신  90  78  18  84.0  B   4.0
  김선미  83  78  19  80.5  B   6.0
  강민경  81  91  19  86.0  B   3.0

In [122]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 6 entries, (1, '송중기') to (1, '강민경')
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   영어      6 non-null      int64
 1   국어      6 non-null      int64
 2   나이      6 non-null      int64
 3   평균      6 non-null      float64
 4   평점      6 non-null      object
 5   rank    6 non-null      float64
dtypes: float64(2), int64(3), object(1)
memory usage: 790.0+ bytes

In [123]:
import numpy as np
import pandas as pd
# Example functions
a = np.add
b = np.sin
c = np.multiply

f = pd.Series.rank
g = pd.DataFrame.mean
h = pd.DataFrame.assign

# Check the type of the functions
print(type(f))  # <class 'numpy.ufunc'>
print(type(g))  # <class 'numpy.ufunc'>
print(type(h))  # <class 'numpy.ufunc'>

<class 'function'>
<class 'function'>
<class 'function'>

In [124]:
df1.apply(lambda x: x.평점, axis=1)

반  이름
1  송중기    B
   권보아    A
   김나형    B
   박효신    B
   김선미    B
   강민경    B
dtype: object

In [126]:
df1.apply(lambda x: x['평점'], axis=1)

반  이름
1  송중기    B
   권보아    A
   김나형    B
   박효신    B
   김선미    B
   강민경    B
dtype: object

In [127]:
df1.apply(lambda x: f"{x.평점}", axis=1)

반  이름
1  송중기    B
   권보아    A
   김나형    B
   박효신    B
   김선미    B
   강민경    B
dtype: object

In [128]:
df1.apply(lambda x: x.rank, axis=1)

반  이름
1  송중기    <bound method NDFrame.rank of 영어        81\n국어...
   권보아    <bound method NDFrame.rank of 영어        81\n국어...
   김나형    <bound method NDFrame.rank of 영어        81\n국어...
   박효신    <bound method NDFrame.rank of 영어        81\n국어...
   김선미    <bound method NDFrame.rank of 영어        81\n국어...
   강민경    <bound method NDFrame.rank of 영어        81\n국어...
dtype: object

In [129]:
df1.apply(lambda x: f"{x.rank}", axis=1)

반  이름
1  송중기    <bound method NDFrame.rank of 영어        92\n국어...
   권보아    <bound method NDFrame.rank of 영어        89\n국어...
   김나형    <bound method NDFrame.rank of 영어        71\n국어...
   박효신    <bound method NDFrame.rank of 영어        90\n국어...
   김선미    <bound method NDFrame.rank of 영어        83\n국어...
   강민경    <bound method NDFrame.rank of 영어        81\n국어...
dtype: object

In [130]:
# df1.apply(lambda x: f"{x.loc['rank']}", axis=1)   🔰🌸💢🍀  이유는 모른다.
df1.apply(lambda x: f"{x['rank']}", axis=1)

반  이름
1  송중기    2.0
   권보아    1.0
   김나형    5.0
   박효신    4.0
   김선미    6.0
   강민경    3.0
dtype: object

In [ ]:
ttl = len(df1['영어'])

In [ ]:
print(type(df1.iloc[0]))

In [ ]:
df1.iloc[0]

In [ ]:
int(df1.iloc[0].loc['rank'])

In [ ]:
df1['반석차'] = df1.apply(lambda x: f"{int(x['rank'])} / {ttl}", axis=1)

list_remaining = list(df1.columns)
list_remaining.pop(-2)
df1 = df1[list_remaining]
df1

# 왠지는 정확히 알 수 없으나 lambda x: x.rank